//Напишіть програму, користувач якої вписує значення двох років(умовно, 1976 та 2010), виводить ці роки та виводить скільки років пройшло між першим та другим значенням – зробити це все через цикл.
//Якщо загальна кількість років більше 100 – зробити вихід із циклу.
//Також кожен десятий елемент у циклі враховувати і вивести їх загальну кількість.Зробити також перевірку для введення неправильних значень.


#include <iostream>
#include <math.h>
using namespace std;
int main() {
    int x, y, razn = 0, des = 0; //(des-каждий десятый элемент)

    cout << "Введите первый год:";
    cin >> x;//первый введенный год
    cout << "Введите второй год:";
    cin >> y;//второй введенный год

    if (x > 0 && y > 0 && x != y && x < y) {
        for (int i = x;i <= y;i++)
        {
            razn++;
            if ((i - x + 1) % 10 == 0)
            {
                des++;
            }

            if (razn > 100) {
                cout << "Пройшло больше 100 лет (выход из цикла)\n";  break;
            }
        }
        cout << "Между " << x << " годом и " << y << " годом прошло" << razn << " лет";
        cout << "\nКількість кожного десятого року: " << des << endl;


    }
    else { cout << "Помилка! Перше значення має бути меншим за друге,а роки мають бути додатними.\n"; }
    return 0;
}